电脑/html5/前端/前端修炼日记.md
<nav id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline1">1. 响应式布局</a></li>
</ul>
</div>
</nav>


# 响应式布局<a id="orgheadline1"></a>

请读者先阅读 [这篇文章](http://www.ruanyifeng.com/blog/2012/05/responsive_web_design.html) 。这篇刚开始 Ethan Marccote 给出的那个例子有个非常重要的信息，那就是设备的像素分级:

-   大于1300像素
-   600到1300像素
-   400到600像素
-   小于400像素

这个像素分级可以为后面我们要根据不同的设备进行css进行设置提供了参考。

然后一般网页都要加上这一行:

    <meta name="viewport" content="width=device-width, initial-scale=1" />

意思是网页默认宽度为设备宽度，原始缩放比为1。

然后就是各个元素宽度最好不要有 `width: xxx px` 这样写死了的css设置，而是 `%` 或者 `auto` 。字体的大小也都推荐使用 `em` 这样的相对大小。

h1 默认大小是 1.5em 。

    h1 {
        font-size: 1.5em; 
    }

small 默认是 0.875em 。

    small {
        font-size: 0.875em;
    }

流动式布局，各个区块的位置都是浮动的，有些情况下会需要使用 `position: absolute` ，这会带来很多麻烦，尽量少用。

根据屏幕响应式多个css配置适应: 【因为css有很多通用配置是多设备皆适用的，下面这些根据屏幕响应的css应该放在css文件的最后面。】

参看 [这篇文章](http://learn.shayhowe.com/advanced-html-css/responsive-web-design/) ，其提到了现在流行的 mobile-first 设计思路，也就是有限照顾手机小屏幕设备的设计流程。先写好通用css配置，然后css文件最后面如下设置这些屏幕响应css设置。从最小的屏幕照顾起:  

```css
@media screen and (min-width: 400px) {
    这里放着屏幕小于400px时的配置
}

@media screen and (min-width:600px){
    这里放着屏幕大于400px小于600px的配置
}
@media screen and (min-width:1000px){
    这里放着屏幕大于600px小于1000px的配置 
}

@media screen and (min-width:1400px){
    这里放着屏幕大于1400px时的css配置
}
```

图片的自适应，如下设置最大宽度。

    img { max-width: 100%;}